<script>
    import CatalogItem from "$lib/catalogItem/catalogItem.svelte";
    import alumSrc from './alum.jpg';
    import plasticSrc from './plastic.jpg';
    import tkanSrc from './tkan.jpg';

    const products = [
    {
        name: 'Тканевые',
        descr: 'Коллекция тканей для вертикальных жалюзи  вмещает в себя сотни разнообразных материалов: однотонных и с фактурным или набивным рисунком, с нежными пастельными оттенками и, наоборот, ярких и вызывающе-смелых расцветок, различных по плотности - от полупрозрачных невесомых тканей до увесистых полотен «Black-out», полностью блокирующих свет.<br><br> Ламели вертикальных тканевых жалюзи могут быть выполнены из различных материалов от эксклюзивных натуральных (бамбуковые, хлопчатобумажные полотна) до экономичных тканей из полиэстера.<br><br>Срок службы – более 10 лет!',
        url: tkanSrc,
    },   
    {
        name: 'Пластиковые',
        descr: 'Вертикальные пластиковые жалюзи отличаются высоким уровнем жёсткости и устойчивостью к влаге. Не требуют частого обслуживания. Идеальны для медицинских и производственных помещений.<br><br>Пластиковые жалюзи обладают следующими положительными характеристиками: <br><br>- Отталкивание влаги. <br>- Защита от скопления грязи. <br>- Простота обработки для дезинфекции. <br>- Устойчивость к выгоранию.<br>- Хорошая текстура.',
        url: alumSrc,
    },
    {
        name: 'Мультифактурные',
        descr: 'Мультифактурные жалюзи  - имитация привычных портьер в  деловом стиле. <br><br>Это эффектная комбинация разных видов ткани и декоративных элементов в виде зеркальных вставок под золото или серебро.<br><br>Фактура набора материалов,  применяемых  в  одном изделии,  может  быть одного или нескольких типов. В собранном виде ламели мультифактурных жалюзи являют собой уникальный рисунок, который разрабатывается для каждого заказчика индивидуально. ',
        url: plasticSrc,
    },
];
    </script>
    
    <div>
        <CatalogItem name='Вертикальные жалюзи' products={products}/>
    </div>

    <style lang='scss'>
    </style>