<script>
import CatalogItem from "$lib/catalogItem/catalogItem.svelte";
import uniSrc from './img/rolled_uni.jpg';
import miniSrc from './img//rolled_mini.jpg';
import classicSrc from './img//rolled_classic.jpg';
import zebraSrc from './img//rolled_zebra.jpg';
import boSrc from './img/rolled_bo.jpg';


const products = [
    {
        name: 'Системы "UNI"',
        descr: 'Рулонные шторы систем "UNI" с коробом и направляющими смотрятся единым целым с рамой евроокна благодаря лаконичной конструкции в широкой цветовой гамме фурнитуры. <br><br> Компактный короб-кассета скрывает тканевый рулон и механизмы, а направляющие надежно защищают от боковых просветов и провисания ткани на откидных створках. Модельный ряд представлен изделиями с цепочным и пружинным механизмом управления, а также моторизацией.',
        url: uniSrc,
    },
    {
        name: 'Система "MINI"',
        descr: 'Система "MINI" - самая лёгкая и компактная рулоная штора с открытым рулоном для евроокон. Помимо сверления её можно устанавливать на накидные кронштейны или платформы с клейкой лентой. <br><br> Для поворотно-откидных створок предусмотрена боковая фиксация с помощью лески или магнитов. Модель "MINI" представлена в трёх цветах фурнитуры: белый, дуб, коричневый.',
        url: miniSrc,
    },
    {
        name: 'BLACK-OUT',
        descr: 'Рулонные шторы блэкаут с полотном из светонепроницаемой ткани предназначены для тех помещений, где периодически необходимо создать полумрак.<br><br>Наилучшая степень затемнения достигается при использовании материалов блэкаут в системе юни2.<br><br>Наличие светоотражающего слоя в некоторых тканях типа блэкаут предотвращает нагрев внутри помещения при высокой температуре снаружи.',
        url: boSrc,
    },
    {
        name: 'Система "Классика LUX"',
        descr: `Система "Классика LUX" - универсальное решение для оформления световых проёмов средних и больших размеров единым полотном. Такие изделия дают возможность применить ткани с большим раппортом и воплотить в жизнь самый фантастический дизайнерский проект. <br><br> Эта модель представляет собой открытый классический вариант рулонной шторы с монтажным профилем и прямой намоткой ткани на трубу. <br><br> Варианты управления реализованы с помощью цепочного и пружинно-инерционного механизмов, а также возможно исполнение в моторизованном варианте.`,
        url: classicSrc,
    },
    {
        name: 'Зебра',
        descr: `Рулонные шторы "Зебра" сочетают в себе функционал горизонтальных жалюзи по управлению световым потоком и эстетическую составляющую классических рулонных штор.<br><br> В готовом изделии используется двойное полотно ткани "Зебра", позволяющее закрыться от посторонних глаз и регулировать поступление света в помещение за счёт смещения чередующихся полос плотной ткани и прозрачной сетки-вуали относительно друг друга.<br><br> Возможно исполнение во всех системах рулонных штор.`,
        url: zebraSrc,
    },
    
];
</script>

<div>
    <CatalogItem name='Рулонные шторы' products={products}/>
</div>

<style lang='scss'>
</style>