<script>
import CatalogItem from "$lib/catalogItem/catalogItem.svelte";
import zebraSrc from '../../img/zebra__bg.png';

const products = [
    {
        name: 'Системы "UNI"',
        descr: 'Рулонные шторы систем "UNI" с коробом и направляющими смотрятся единым целым с рамой евроокна благодаря лаконичной конструкции в широкой цветовой гамме фурнитуры. <br><br> Элегантный короб-кассета скрывает тканевый рулон и механизмы, а направляющие надежно защищают от боковых просветов и провисания ткани на откидных створках. Модельный ряд представлен изделиями с цепочным и пружинным механизмом управления, а также моторизацией.',
        url: zebraSrc,
    },
    {
        name: 'Система "MINI"',
        descr: 'Система "MINI" - самая лёгкая и компактная рулоная штора с открытым рулоном для евроокон. Помимо сверления её можно устанавливать на накидные кронштейны или платформы с клейкой лентой. <br><br> Для поворотно-откидных створок предусмотрена боковая фиксация с помощью лески или магнитов. Модель "MINI" представлена в трёх цветах фурнитуры: белый, дуб, коричневый.',
        url: zebraSrc,
    },
    {
        name: 'BLACK-OUT',
        descr: 'Рулонные шторы с полотном из тканей типа "BLACK-OUT" являются полнофункциональным светофильтром для окон и позволяют максимально затемнить помещение независимо от интенсивности солнечного потока за окном. <br><br> Они незаменимы в оформлении помещений, где время от времени необходимо создать полумрак. В настоящее время они широко используются практически в любых',
        url: zebraSrc,
    },
    {
        name: 'Система "Классика LUX"',
        descr: `Система "Классика LUX" - универсальное решение для оформления световых проёмов средних и больших размеров единым полотном. Такие изделия дают возможность применить ткани с большим раппортом и воплотить в жизнь самый фантастический дизайнерский проект. <br><br> Эта модель представляет собой открытый классический вариант рулонной шторы с монтажным профилем и прямой намоткой ткани на трубу. <br><br> Варианты управления реализованы с помощью цепочного и пружинно-инерционного механизмов, а также возможно исполнение в моторизованном варианте.`,
        url: zebraSrc,
    },
    {
        name: 'Зебра',
        descr: `Рулонные шторы "Зебра" сочетают в себе функционал горизонтальных жалюзи по управлению световым потоком и эстетическую составляющую классических рулонных штор.<br><br> В готовом изделии используется двойное полотно ткани "Зебра", позволяющее закрыться от посторонних глаз и регулировать поступление света в помещение за счёт смещения чередующихся полос плотной ткани и прозрачной сетки-вуали относительно друг друга.<br><br> Возможно исполнение во всех системах рулонных штор.`,
        url: zebraSrc,
    },
    
];
</script>

<div>
    <CatalogItem name='Рулонные жалюзи' products={products}/>
</div>

<style lang='scss'>
    div {
        display: flex;
        flex-direction: column;
        min-height: 74vh;
        justify-content: center;
        align-items: center;
    }
</style>